[
    {
        "id": "1",
        "companyName": "Critical Techworks",
        "position": "Android Engineer",
        "from": "07/2024",
        "to": "current",
        "location": "Porto, Portugal",
        "description": "In this experience, I work with Android technologies, focused on the automotive sector. This sector is demanding, respectively, the quality and safety of the system are crucial. This allowed me to have new perspectives on software development, as well as the acquisition of new techniques and development patterns in technologies that I had never had contact with.",
        "mainResponsabilities": [
            "Development and maintenance of Android applications with a focus on performance, security and usability.",
            "Collaboration with multidisciplinary teams to deliver innovative solutions in highly complex projects.",
            "Use of technologies such as Kotlin, Android SDK, and Jetpack to build intuitive and efficient interfaces.",
            "Implementation of good development practices, including unit testing, continuous integration (CI/CD) and version control (Git).",
            "Code optimization and bug resolution to improve application stability and performance.",
            "Participation in code reviews and agile planning sessions (Scrum/Kanban) to ensure quality and on-time delivery."
        ],
        "mainTechnologies": [
            "Kotlin",
            "Java",
            "Android SDK",
            "Jetpack",
            "Gradle",
            "GitHub",
            "Git",
            "JUnit",
            "Dagger Hilt",
            "Jira",
            "Confluence",
            "Android Studio"
        ],
        "companyDescription": "Critical Techworks is a joint venture between the BMW Group and Critical Software, focused on developing cutting-edge technologies for the automotive sector. The company creates digital solutions for connected vehicles, smart mobility, and infotainment systems, blending advanced software with engineering excellence. Working in an agile, collaborative environment, CTW is at the forefront of digital transformation in the automotive industry.",
        "companyWebsite": "https://www.criticaltechworks.com/",
        "companyLogoURLString": "https://images.teamtailor-cdn.com/images/s3/teamtailor-production/logotype-v3/image_uploads/d3ed9da8-d0a4-4382-a68a-3b52fd87e5eb/original.png"
    },
    {
        "id": "2",
        "companyName": "Farfetch",
        "position": "Mobile iOS Engineer Intern",
        "from": "09/2023",
        "to": "03/2024",
        "location": "Porto, Portugal",
        "description": "This was my second professional experience, still within the iOS development area. This experience allowed me to deepen my knowledge of native iOS and other technologies through contact with very intelligent people who transmitted me immense knowledge and technologies at the forefront of innovation.",
        "mainResponsabilities": [
            "Implementation of functionalities in a mobile application using iOS technologies.",
            "Maintenance of functionalities in a mobile application using iOS technologies.",
            "Optimization of an iOS application."
        ],
        "mainTechnologies": [
            "Swift",
            "Objective-C",
            "SwiftUI",
            "Fork",
            "GitLab"
        ],
        "companyDescription": "Farfetch is an online luxury fashion retail platform connecting consumers with boutiques and brands worldwide. It offers a curated selection of clothing, accessories, and lifestyle products, ranging from high-end designers to emerging labels. Farfetch provides a unique shopping experience, allowing customers to discover and purchase luxury items from around the globe through its website and app. It merges technology with fashion, offering features like augmented reality for virtual try-ons and personalized recommendations. Farfetch aims to redefine the luxury retail landscape by offering accessibility, diversity, and innovation in the realm of high-end fashion.",
        "companyWebsite": "https://aboutfarfetch.com/about/farfetch",
        "companyLogoURLString": "https://www.farfetch.com/static/images/logo.png"
    },
    {
        "id": "3",
        "companyName": "ITSector",
        "position": "Mobile iOS Engineer Intern",
        "from": "03/2023",
        "to": "06/2023",
        "location": "Porto, Portugal",
        "description": "This was my first professional experience, having occurred through a curricular internship at the end of my degree. In this experience I had my first contact with iOS development with native technologies. I acquired a very solid base of knowledge and motivation to pursue a career in the area of iOS Deveolpment.",
        "mainResponsabilities": [
            "Incorporating features into a mobile app using iOS technologies.",
            "Maintenance of functionalities in a mobile application using iOS technologies.",
            "Optimization of an iOS application.",
            "Generating high-quality new releases in accordance with the GitFlow methodology."
        ],
        "mainTechnologies": [
            "Swift",
            "Objective-C",
            "SourceTree"
        ],
        "companyDescription": "ITSector is a technology company specializing in software development and IT solutions. It provides innovative digital products and services tailored to various industries, including banking, insurance, healthcare, and retail. ITSector offers expertise in areas such as software engineering, data analytics, cybersecurity, and digital transformation. By leveraging cutting-edge technologies like artificial intelligence and blockchain, ITSector helps businesses streamline operations, enhance customer experiences, and stay competitive in the digital era. With a focus on quality, agility, and client satisfaction, ITSector aims to be a trusted partner for organizations seeking to harness the power of technology for growth and efficiency.",
        "companyWebsite": "https://www.itsector.pt/about-us",
        "companyLogoURLString": "https://www.itsector.pt/hubfs/itsectorlogo.png"
    }
]

